{
  "_name_or_path": "cointegrated/rubert-tiny",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "1) \u0414\u0440\u0443\u0433\u043e\u0435",
    "1": "2) \u0411\u043b\u043e\u0433\u0438",
    "2": "3) \u041d\u043e\u0432\u043e\u0441\u0442\u0438 \u0438 \u0421\u041c\u0418",
    "3": "4) \u0420\u0430\u0437\u0432\u043b\u0435\u0447\u0435\u043d\u0438\u044f \u0438 \u044e\u043c\u043e\u0440",
    "4": "5) \u0422\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0438",
    "5": "6) \u042d\u043a\u043e\u043d\u043e\u043c\u0438\u043a\u0430",
    "6": "7) \u0411\u0438\u0437\u043d\u0435\u0441 \u0438 \u0441\u0442\u0430\u0440\u0442\u0430\u043f\u044b",
    "7": "8) \u041a\u0440\u0438\u043f\u0442\u043e\u0432\u0430\u043b\u044e\u0442\u044b",
    "8": "9) \u041f\u0443\u0442\u0435\u0448\u0435\u0441\u0442\u0432\u0438\u044f",
    "9": "10) \u041c\u0430\u0440\u043a\u0435\u0442\u0438\u043d\u0433, PR, \u0440\u0435\u043a\u043b\u0430\u043c\u0430",
    "10": "11) \u041f\u0441\u0438\u0445\u043e\u043b\u043e\u0433\u0438\u044f",
    "11": "12) \u0414\u0438\u0437\u0430\u0439\u043d",
    "12": "13) \u041f\u043e\u043b\u0438\u0442\u0438\u043a\u0430",
    "13": "14) \u0418\u0441\u043a\u0443\u0441\u0441\u0442\u0432\u043e",
    "14": "15) \u041f\u0440\u0430\u0432\u043e",
    "15": "16) \u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435 \u0438 \u043f\u043e\u0437\u043d\u0430\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435",
    "16": "17) \u0421\u043f\u043e\u0440\u0442",
    "17": "18) \u041c\u043e\u0434\u0430 \u0438 \u043a\u0440\u0430\u0441\u043e\u0442\u0430",
    "18": "19) \u0417\u0434\u043e\u0440\u043e\u0432\u044c\u0435 \u0438 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0430",
    "19": "20) \u041a\u0430\u0440\u0442\u0438\u043d\u043a\u0438 \u0438 \u0444\u043e\u0442\u043e",
    "20": "21) \u0421\u043e\u0444\u0442 \u0438 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u044f",
    "21": "22) \u0412\u0438\u0434\u0435\u043e \u0438 \u0444\u0438\u043b\u044c\u043c\u044b",
    "22": "23) \u041c\u0443\u0437\u044b\u043a\u0430",
    "23": "24) \u0418\u0433\u0440\u044b",
    "24": "25) \u0415\u0434\u0430 \u0438 \u043a\u0443\u043b\u0438\u043d\u0430\u0440\u0438\u044f",
    "25": "26) \u0426\u0438\u0442\u0430\u0442\u044b",
    "26": "27) \u0420\u0443\u043a\u043e\u0434\u0435\u043b\u0438\u0435",
    "27": "28) \u0424\u0438\u043d\u0430\u043d\u0441\u044b",
    "28": "29) \u0428\u043e\u0443\u0431\u0438\u0437"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "1) \u0414\u0440\u0443\u0433\u043e\u0435": 0,
    "10) \u041c\u0430\u0440\u043a\u0435\u0442\u0438\u043d\u0433, PR, \u0440\u0435\u043a\u043b\u0430\u043c\u0430": 9,
    "11) \u041f\u0441\u0438\u0445\u043e\u043b\u043e\u0433\u0438\u044f": 10,
    "12) \u0414\u0438\u0437\u0430\u0439\u043d": 11,
    "13) \u041f\u043e\u043b\u0438\u0442\u0438\u043a\u0430": 12,
    "14) \u0418\u0441\u043a\u0443\u0441\u0441\u0442\u0432\u043e": 13,
    "15) \u041f\u0440\u0430\u0432\u043e": 14,
    "16) \u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435 \u0438 \u043f\u043e\u0437\u043d\u0430\u0432\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435": 15,
    "17) \u0421\u043f\u043e\u0440\u0442": 16,
    "18) \u041c\u043e\u0434\u0430 \u0438 \u043a\u0440\u0430\u0441\u043e\u0442\u0430": 17,
    "19) \u0417\u0434\u043e\u0440\u043e\u0432\u044c\u0435 \u0438 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0430": 18,
    "2) \u0411\u043b\u043e\u0433\u0438": 1,
    "20) \u041a\u0430\u0440\u0442\u0438\u043d\u043a\u0438 \u0438 \u0444\u043e\u0442\u043e": 19,
    "21) \u0421\u043e\u0444\u0442 \u0438 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u044f": 20,
    "22) \u0412\u0438\u0434\u0435\u043e \u0438 \u0444\u0438\u043b\u044c\u043c\u044b": 21,
    "23) \u041c\u0443\u0437\u044b\u043a\u0430": 22,
    "24) \u0418\u0433\u0440\u044b": 23,
    "25) \u0415\u0434\u0430 \u0438 \u043a\u0443\u043b\u0438\u043d\u0430\u0440\u0438\u044f": 24,
    "26) \u0426\u0438\u0442\u0430\u0442\u044b": 25,
    "27) \u0420\u0443\u043a\u043e\u0434\u0435\u043b\u0438\u0435": 26,
    "28) \u0424\u0438\u043d\u0430\u043d\u0441\u044b": 27,
    "29) \u0428\u043e\u0443\u0431\u0438\u0437": 28,
    "3) \u041d\u043e\u0432\u043e\u0441\u0442\u0438 \u0438 \u0421\u041c\u0418": 2,
    "4) \u0420\u0430\u0437\u0432\u043b\u0435\u0447\u0435\u043d\u0438\u044f \u0438 \u044e\u043c\u043e\u0440": 3,
    "5) \u0422\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0438": 4,
    "6) \u042d\u043a\u043e\u043d\u043e\u043c\u0438\u043a\u0430": 5,
    "7) \u0411\u0438\u0437\u043d\u0435\u0441 \u0438 \u0441\u0442\u0430\u0440\u0442\u0430\u043f\u044b": 6,
    "8) \u041a\u0440\u0438\u043f\u0442\u043e\u0432\u0430\u043b\u044e\u0442\u044b": 7,
    "9) \u041f\u0443\u0442\u0435\u0448\u0435\u0441\u0442\u0432\u0438\u044f": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.36.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29564
}
